
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8671041790)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_firestore_database.datastore_mode_database
  * google_project_service.vision_api
* Update
  * google_storage_bucket.public_image_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_firestore_database.datastore_mode_database will be created
  + resource "google_firestore_database" "datastore_mode_database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "asia-northeast1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "my-project-name"
      + type                              = "DATASTORE_MODE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_service.vision_api will be created
  + resource "google_project_service" "vision_api" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "lgtmgen-project"
      + service            = "vision.googleapis.com"
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":5,"Program":"tfcmt","SHA1":"8d80fbe7e53ffa23eb1823645cda60e964748dec","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->